;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! evil-org)
(package! org-cliplink)
(package! julia-repl)
(package! org-babel-eval-in-repl)
(package! org-ref)
(package! toc-org)
(package! elpy)
(package! company-box)
(package! org-noter)
(package! org-bullets)
